Revit 2024 API
GuidEnum Class
 Base class of all GUID-based enum classes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class GuidEnum
Visual Basic
Public Class GuidEnum
Visual C++
public ref class GuidEnum
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.ExternalResourceType
 Autodesk.Revit.DB.ExternalService.ExternalServiceId
 Autodesk.Revit.DB.FailureDefinitionId
 Autodesk.Revit.DB.NumberingSchemaType
 Autodesk.Revit.DB.PerformanceAdviserRuleId
 Autodesk.Revit.UI.DockablePaneId
See Also
GuidEnum Members
Autodesk.Revit.DB Namespace